#Область Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тзСтруктураМетаданныхКонфигурации = ЭтаОбработка().СтруктураМетаданныхКонфигурации();
	ЗначениеВРеквизитФормы(тзСтруктураМетаданныхКонфигурации, "СтруктураМетаданныхКонфигурации");
	
	Элементы.СтруктураМетаданныхКонфигурацииПредставление.Заголовок = ЭтаОбработка().КраткаяИнформацияОКонфигурации();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаОткрытьИспользованныйСписокЭлементов(Элемент)
	// Сделать:
	// Разобрать имя элемента, и обработать команду открытия.
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокЭлементовОМНастроитьКолонки(Элемент)
	
	СписокЭлементовОМНастроитьКолонки(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокЭлементовОМЗакрыть(Элемент)
	
	Попытка
		СписокЭлементовОМЗакрыть(Элемент.Имя);
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСтруктуруОМ(Команда)
	
	#Область Предусловия
	
	Если Элементы.СтруктураМетаданныхКонфигурации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ОтобразитьСтруктуруОбъектаМетаданных(Элементы.СтруктураМетаданныхКонфигурации.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСвойстваОМ(Команда)
	
	ОтобразитьСвойстваОбъектаМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьПоказатьСтруктураМетаданныхКонфигурации(Команда)
	
	СкрытьПоказатьСтруктураМетаданныхКонфигурации();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьКоличество(Команда)
	
	ОтобразитьКоличествоЭлементовКоллекции(Элементы.СтруктураМетаданныхКонфигурации.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьСписокЭлементовОМ(Команда)
	
	ДанныеСтроки = СтруктураСтрокиМетаданныхКонфигурации(Элементы.СтруктураМетаданныхКонфигурации.ТекущиеДанные);
	ОтобразитьСписокЭлементовКоллекции(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьНастройкиКолонокСписка(Команда)
	
	Элементы.ГруппаНастройкаКолонокСписка.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьФормуОПрограмме(Команда)
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаОПрограмме");
	ОткрытьФорму(ПолноеИмяФормы, , ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьФормуНастройкиНавигатора(Команда)
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаНастройкиНавигатора");
	ОткрытьФорму(ПолноеИмяФормы, , ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьВсеОкна(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область Таблицы

#Область СтруктураМетаданныхКонфигурации

&НаКлиенте
Процедура СтруктураМетаданныхКонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СтруктураМетаданныхКонфигурации.ТекущиеДанные;
	
	#Область Предусловия
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	Если ТекущиеДанные.СтруктураМетаданныхКонфигурацииИмя = "Константы" 
		И ТекущиеДанные.СтруктураМетаданныхКонфигурацииТипЗаписи = "КоллекцияОбъектовМетаданных" 
		И ТекущиеДанные.СтруктураМетаданныхКонфигурацииИмяКоллекции = "Константы" Тогда
		
		ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаЗначенияКонстант");
		ОткрытьФорму(ПолноеИмяФормы, , ЭтаФорма, Истина);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущиеДанные.СтруктураМетаданныхКонфигурацииИмя = "Пользователи" 
		И ТекущиеДанные.СтруктураМетаданныхКонфигурацииТипЗаписи = "КоллекцияОбъектовМетаданных" 
		И ТекущиеДанные.СтруктураМетаданныхКонфигурацииИмяКоллекции = "Пользователи" Тогда
		
		ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаПользователиБазы");
		ОткрытьФорму(ПолноеИмяФормы, , ЭтаФорма, Истина);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущиеДанные.СтруктураМетаданныхКонфигурацииТипЗаписи = "ПользовательИнформационнойБазы" Тогда
		
		ОбъектКонфигурации = Новый Структура;
		ОбъектКонфигурации.Вставить("ТипОбъекта", "ПользовательИнформационнойБазы");
		ОбъектКонфигурации.Вставить("ИмяПользователя", ТекущиеДанные.СтруктураМетаданныхКонфигурацииИмя);
		
		ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаПользователиБазы");
		ОткрытьФорму(ПолноеИмяФормы, ОбъектКонфигурации, ЭтаФорма, Истина);
		
		Возврат;
		
	КонецЕсли;
	
	Если Поле.Имя = "СтруктураМетаданныхКонфигурацииКоличествоЗаписей" Тогда
		ОтобразитьКоличествоЭлементовКоллекции(ТекущиеДанные);
	Иначе
		
		ОтобразитьКоличествоЭлементовКоллекции(ТекущиеДанные);
		
		// Обработать выбор строки дерева метаданных.
		
		СтруктураСтрокиМетаданных = СтруктураСтрокиМетаданныхКонфигурации(ТекущиеДанные);
		ПриВыбореСтрокиСтруктурыМетаданныхКонфигурации(СтруктураСтрокиМетаданных);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КолонкиСпискаВидимостьКолонки

&НаКлиенте
Процедура НастройкиКолонокСпискаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	//
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокСпискаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	//
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокСпискаВидимостьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиКолонокСписка.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[ТекущиеДанные.НастройкиКолонокСпискаИмяКолонки].Видимость = ТекущиеДанные.НастройкиКолонокСпискаВидимость;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокСпискаПриИзменении(Элемент)
	
	// Сделать:
	// Добавить возможность изменять порядок колонок.
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкиКолонокСпискаОтметитьВсе(Команда)
	НастройкиКолонокСпискаУстановитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкиКолонокСпискаСнятьВсе(Команда)
	НастройкиКолонокСпискаУстановитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокСпискаУстановитьПометки(Пометка)
	
	ЭлементыНастройкиКолонокСписка = НастройкиКолонокСписка.ПолучитьЭлементы();
	
	Для каждого ЭлементСтрокаНастройкиКолонокСписка Из ЭлементыНастройкиКолонокСписка Цикл
		
		ВлЭлементы = ЭлементСтрокаНастройкиКолонокСписка.ПолучитьЭлементы();
		
		Для каждого ВлЭлемент Из ВлЭлементы Цикл
			ВлЭлемент.НастройкиКолонокСпискаВидимость = Пометка;
			Элементы[ВлЭлемент.НастройкиКолонокСпискаИмяКолонки].Видимость = ВлЭлемент.НастройкиКолонокСпискаВидимость;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область Процедуры

#Область НаКлиенте

&НаКлиенте
Процедура ПриВыбореСтрокиСтруктурыМетаданныхКонфигурации(ДанныеСтроки)
	
	#Область Предусловия
	
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ОтображениеСпискаЭлементовДоступно = ОтображениеСпискаЭлементовКоллекцииДоступно(ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяКоллекции);
	
	Если ДанныеСтроки.СтруктураМетаданныхКонфигурацииТипЗаписи = "ОбъектМетаданных" Тогда
		Если ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции = "Форма" Тогда
			// Сделать:
			// Сформировать имя формы (это надо подняться до элемента-родителя), открыть форму.
		Иначе
			Если ОтображениеСпискаЭлементовДоступно Тогда
				ОтобразитьСписокЭлементовКоллекции(ДанныеСтроки);
			Иначе
				ОбработатьВыборСтрокиОбъектаОбработкиДанных(ДанныеСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСтрокиОбъектаОбработкиДанных(ДанныеСтроки)
	
	#Область Предусловия
	
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ЯвляетсяСредствомОбработки = ЭлементКоллекцииЯвляетсяСредствомОбработкиДанных(ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяКоллекции);
	
	Если Не ЯвляетсяСредствомОбработки Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваОбъекта = Тип_СвойстваОбъектаОбработкиДанных();
	СвойстваОбъекта.ИмяКоллекции = ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяКоллекции;
	СвойстваОбъекта.ИмяЭлементаКоллекции = ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции;
	СвойстваОбъекта.Имя = ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмя;
	
	ИмяОсновнойФормы = ИмяОсновнойФормыОбъектаОбработкиДанных(СвойстваОбъекта);
	
	Если Не ЗначениеЗаполнено(ИмяОсновнойФормы) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ИмяОсновнойФормы, , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьКоличествоЭлементовКоллекции(ДанныеСтроки)
	
	#Область Предусловия
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	КолЗаписей = КоличествоЭлементовКоллекцииТипаОбъектаМетаданных(
		ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции, 
		ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмя
	);
	ДанныеСтроки.СтруктураМетаданныхКонфигурацииКоличествоЗаписей = КолЗаписей;
	
	Если КолЗаписей = 0 Тогда
		ДанныеСтроки.СтруктураМетаданныхКонфигурацииПредставление = ПодставитьПараметрыВСтроку("%1", ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмя);
	Иначе
		ДанныеСтроки.СтруктураМетаданныхКонфигурацииПредставление = ПодставитьПараметрыВСтроку("%1 (%2)", ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмя, КолЗаписей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСвойстваОбъектаМетаданных()
	
	#Область Предусловия
	
	Если Элементы.СтруктураМетаданныхКонфигурации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ПараметрыФормы = Новый Структура();
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаСвойстваОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтруктуруОбъектаМетаданных(ИдСтроки)
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИдСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	СтрокаДерева = СтруктураМетаданныхКонфигурации.НайтиПоИдентификатору(ИдСтроки);
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОбъекта = СтруктураОбъектаМетаданных(
		СтрокаДерева.СтруктураМетаданныхКонфигурацииИмяКоллекции, 
		СтрокаДерева.СтруктураМетаданныхКонфигурацииИмя
	);
	
	Если СтруктураОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
	ПодчиненныеСтроки.Очистить();
	
	Для каждого КлючЗначение Из СтруктураОбъекта Цикл
		
		СтрокаКоллекции = ПодчиненныеСтроки.Добавить();
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииИмя = КлючЗначение.Ключ;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииПредставление = КлючЗначение.Ключ;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииСиноним = КлючЗначение.Значение.Коллекция.Синоним;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииТипЗаписи = КлючЗначение.Значение.Коллекция.ТипЗаписи;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииИмяКоллекции = КлючЗначение.Значение.Коллекция.ИмяКоллекции;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции = КлючЗначение.Значение.Коллекция.ИмяЭлементаКоллекции;
		СтрокаКоллекции.СтруктураМетаданныхКонфигурацииНомерКартинки = КлючЗначение.Значение.Коллекция.НомерКартинки;
		
		СтрокиКоллекции = СтрокаКоллекции.ПолучитьЭлементы();
		
		Для каждого ДанныеЭлементаКоллекции Из КлючЗначение.Значение.ДанныеКоллекции Цикл
			
			СтрокаЭлементаКоллекции = СтрокиКоллекции.Добавить();
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииИмя = ДанныеЭлементаКоллекции.Имя;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииПредставление = ДанныеЭлементаКоллекции.Имя;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииСиноним = ДанныеЭлементаКоллекции.Синоним;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииТипЗаписи = ДанныеЭлементаКоллекции.ТипЗаписи;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииИмяКоллекции = КлючЗначение.Значение.Коллекция.ИмяКоллекции;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции = КлючЗначение.Значение.Коллекция.ИмяЭлементаКоллекции;
			СтрокаЭлементаКоллекции.СтруктураМетаданныхКонфигурацииНомерКартинки = КлючЗначение.Значение.Коллекция.НомерКартинки;
			
			Если Не ДанныеЭлементаКоллекции.ДанныеКоллекции.Количество() = 0 Тогда
				
				СтрокиКоллекцииРеквизиты = СтрокаЭлементаКоллекции.ПолучитьЭлементы();
				
				Для каждого СтруктураРеквизита Из ДанныеЭлементаКоллекции.ДанныеКоллекции Цикл
					
					СтрокаРеквизита = СтрокиКоллекцииРеквизиты.Добавить();
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииИмя = СтруктураРеквизита.Имя;
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииПредставление = СтруктураРеквизита.Имя;
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииСиноним = СтруктураРеквизита.Синоним;
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииТипЗаписи = СтруктураРеквизита.ТипЗаписи;
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииИмяКоллекции = "Реквизиты";
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции = "Реквизит";
					СтрокаРеквизита.СтруктураМетаданныхКонфигурацииНомерКартинки = 45;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Элементы.СтруктураМетаданныхКонфигурации.Развернуть(ИдСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьСтруктураМетаданныхКонфигурации()
	
	Элементы.СтруктураМетаданныхКонфигурации.Видимость = Не Элементы.СтруктураМетаданныхКонфигурации.Видимость;
	Элементы.КомандаСкрытьПоказатьСтруктураМетаданныхКонфигурации.Пометка = Элементы.СтруктураМетаданныхКонфигурации.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область НаСервере

&НаСервере
Процедура ОтобразитьСписокЭлементовКоллекции(ДанныеСтроки)
	
	// Добавить страницу списка элементов объекта метаданных.
	
	СтраницаСпискаЭлементовОМ = Неопределено;
	ДобавитьСтраницуСпискаЭлементовОМ(ДанныеСтроки, СтраницаСпискаЭлементовОМ);
	
	Если СтраницаСпискаЭлементовОМ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Добавить список элементов объекта метаданных.
	
	СписокЭлементовОМ = Неопределено;
	ДобавитьСписокЭлементовОМ(ДанныеСтроки, СтраницаСпискаЭлементовОМ, СписокЭлементовОМ);
	
	ПараметрыДобКолонок = Новый Структура;
	
	ДобавитьКолонкиСпискаЭлементовОМ(СписокЭлементовОМ, ДанныеСтроки);
	
	// Активизировать добавленную страницу.
	
	Элементы.СтраницыСписковЭлементовОбъектовМетаданныхКонфгурации.ТекущаяСтраница = СтраницаСпискаЭлементовОМ;
	
	ДобавитьКомандуДляОткрытыхОбъектов(ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуДляОткрытыхОбъектов(ДанныеСтроки)
	
	ИмяКоманды = "КомандаОткрытьИспользованныйСписокЭлементов" + Формат(Элементы.ФормаПодменюПоследниеОбъекты.ПодчиненныеЭлементы.Количество() + 1, "ЧГ=0");
	ЗаголовокКоманды = 
		"" 
		+ Элементы.ФормаПодменюПоследниеОбъекты.ПодчиненныеЭлементы.Количество() + 1
		+ " " 
		+ ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции 
		+ "." 
		+ ДанныеСтроки.СтруктураМетаданныхКонфигурацииИмя;
	
	ПодсказкаКоманды = "";
	ДействиеКоманды = "КомандаОткрытьИспользованныйСписокЭлементов";
	
	КомандаИспСписок = Команды.Добавить(ИмяКоманды);
	КомандаИспСписок.Заголовок = ЗаголовокКоманды;
	КомандаИспСписок.Подсказка = ПодсказкаКоманды;
	КомандаИспСписок.Действие = ДействиеКоманды;
	
	ИмяЭлемента = ИмяКоманды;
	
	ЭлИспСписок = Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Элементы.ФормаПодменюПоследниеОбъекты);
	ЭлИспСписок.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	ЭлИспСписок.Заголовок = ЗаголовокКоманды;
	ЭлИспСписок.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСписокЭлементовОМ(СтрокаСтруктуры, СтраницаСписка, СписокЭлементов)
	
	ИмяСпискаЭлементов = ИмяСпискаЭлементовОбъектаМетаданных(СтрокаСтруктуры);
	ИмяОсновнойТаблицыСписка = ИмяОсновнойТаблицыСпискаЭлементовОбъектаМетаданных(СтрокаСтруктуры);
	
	// Добавить реквизит формы списка элементов.
	
	РеквизитФормы = Новый РеквизитФормы(ИмяСпискаЭлементов, 
		Новый ОписаниеТипов("ДинамическийСписок"), , СтрокаСтруктуры.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции + "." + СтрокаСтруктуры.СтруктураМетаданныхКонфигурацииИмя);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ЭтаФорма[ИмяСпискаЭлементов].ОсновнаяТаблица = ИмяОсновнойТаблицыСписка;
	
	// Добавить элемент формы - список.
	
	СписокЭлементов = ЭтаФорма.Элементы.Добавить(ИмяСпискаЭлементов, Тип("ТаблицаФормы"), СтраницаСписка);
	СписокЭлементов.ПутьКДанным = ИмяСпискаЭлементов;
	СписокЭлементов.Видимость = Истина;
	
	Подменю = Неопределено;
	ДобавитьПодменюДопКомандСписка(СписокЭлементов, Подменю);
	
	ДобавитьКомандуНастройкиКолонокСпискаЭлементовОМ(СписокЭлементов, Подменю);
	ДобавитьКомандуЗакрытияСпискаЭлементовОМ(СписокЭлементов, Подменю);
	
	СписокЭлементов.УстановитьДействие("Выбор", "Подключаемый_СписокЭлементовОбъектаМетаданных_Выбор");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиСпискаЭлементовОМ(СписокЭлементов, СтрокаСтруктуры)
	
	ИмяСписка = СписокЭлементов.Имя;
	
	ПараметрыКолонок = ПараметрыКолонокСпискаЭлементовОМ(СтрокаСтруктуры);
	
	Для каждого КлючЗначение Из ПараметрыКолонок Цикл
		
		КоллекцияКолонок = КлючЗначение.Значение;
		
		Для Каждого ПараметрыКолонки Из КоллекцияКолонок Цикл
			
			ИмяКолонкиСписка = ИмяКолонкиСпискаЭлементовОМ(ПараметрыКолонки.ИмяРеквизита, СтрокаСтруктуры);
			ПутьКДаннымКолонкиСписка = ПутьКДаннымКолонкиСпискаЭлементовОМ(ИмяСписка, ПараметрыКолонки.ИмяРеквизита);
			
			Попытка
				
				Колонка = Элементы.Добавить(ИмяКолонкиСписка, Тип("ПолеФормы"), Элементы[ИмяСписка]);
				Колонка.Вид = ВидПоляФормы.ПолеНадписи;
				Колонка.ПутьКДанным = ПутьКДаннымКолонкиСписка;
				Колонка.Заголовок = ПараметрыКолонки.ИмяРеквизита;
				Колонка.Видимость = ПараметрыКолонки.Видимость;
				
			Исключение
				//
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуНастройкиКолонокСпискаЭлементовОМ(СписокЭлементов, Подменю)
	
	#Область Предусловия
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ИмяКоманды = ИмяДопКомандыСпискаЭлементовОМ(СписокЭлементов.Имя, "НастройкаКолонок");
	
	Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	Команда.Действие = "КомандаСписокЭлементовОМНастроитьКолонки";
	Команда.Подсказка = "Настроить видимость колонок";
	
	Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Подменю);
	Элемент.ИмяКоманды = ИмяКоманды;
	Элемент.ТолькоВоВсехДействиях = Ложь;
	Элемент.Заголовок = "Колонки";
	Элемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Элемент.Картинка = БиблиотекаКартинок.НастройкиОтчета;
	//Элемент.ЦветТекста = WebЦвета.Белоснежный;
	//Элемент.ЦветФона = WebЦвета.Васильковый;
	//Элемент.Шрифт = Новый Шрифт(, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодменюДопКомандСписка(СписокЭлементов, Подменю)
	
	#Область Предусловия
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ЭтаОбработка = ЭтаОбработка();
	
	ИмяПодменю = ЭтаОбработка.ПодставитьПараметрыВСтроку("Подменю" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "ДопКоманды", СписокЭлементов.Имя);
	
	Подменю = Элементы.Добавить(ИмяПодменю, Тип("ГруппаФормы"), Элементы[СписокЭлементов.Имя].КоманднаяПанель);
	Подменю.Заголовок = "Список";
	Подменю.Картинка = БиблиотекаКартинок.КонструкторЗапросаПараметрыТаблицы;
	Подменю.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуЗакрытияСпискаЭлементовОМ(СписокЭлементов, Подменю)
	
	#Область Предусловия
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ИмяКоманды = ИмяДопКомандыСпискаЭлементовОМ(СписокЭлементов.Имя, "Закрыть");
	
	Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	Команда.Действие = "КомандаСписокЭлементовОМЗакрыть";
	Команда.Подсказка = "Закрыть страницу";
	
	Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Подменю);
	Элемент.ИмяКоманды = ИмяКоманды;
	Элемент.ТолькоВоВсехДействиях = Ложь;
	Элемент.Заголовок = "Закрыть";
	Элемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Элемент.Картинка = БиблиотекаКартинок.Закрыть;
	//Элемент.ЦветТекста = WebЦвета.Белоснежный;
	//Элемент.ЦветФона = WebЦвета.Васильковый;
	//Элемент.Шрифт = Новый Шрифт(, , Истина);
	 
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтраницуСпискаЭлементовОМ(СтрокаСтруктурыМетаданныхКонфигурации, СтраницаСписка)
	
	СтраницаСписка = Неопределено;
	
	ИмяСтраницы = ИмяСтраницыСпискаЭлементовОМ(СтрокаСтруктурыМетаданныхКонфигурации);
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяСтраницы) Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	// Сформировать заголовок страницы.
	
	ЗаголовокСтраницы = ЗаголовокСтраницыСпискаЭлементовОМ(СтрокаСтруктурыМетаданныхКонфигурации);
	
	// Добавить страницу для списка элементов.
	
	СтраницаСписка = ЭтаФорма.Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницыСписковЭлементовОбъектовМетаданныхКонфгурации);
	СтраницаСписка.Заголовок = ЗаголовокСтраницы;
	
КонецПроцедуры

&НаСервере
Процедура УвеличитьСчетчикДобавленныхЭлементов()
	
	СчетчикДобавленныхЭлементов = СчетчикДобавленныхЭлементов + 1;
	
КонецПроцедуры

&НаСервере
Процедура СписокЭлементовОМЗакрыть(ИмяЭлементаКомандыЗакрытия)
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяЭлементаКомандыЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ЭтаОбработка = ЭтаОбработка();
	
	// Удаляет элементы и реквизиты.
	
	ЧастиСтроки = ЭтаОбработка.РазложитьСтрокуВМассивПодстрок(ИмяЭлементаКомандыЗакрытия, Объект.РазделительЧастейИмен); // "Команда_Закрыть_Список_Справочники_Справочник_ДоговорыКонтрагентов_2"
	
	// Сделать: 
	// Переделать на централизованные функции определения имен элементов. 
	// Иначе расползется и костей не собрать.
	
	ИмяСписка   = ЭтаОбработка.ПодставитьПараметрыВСтроку("Список" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "%2" + Объект.РазделительЧастейИмен + "%3" + Объект.РазделительЧастейИмен + "%4", ЧастиСтроки[3], ЧастиСтроки[4], ЧастиСтроки[5], ЧастиСтроки[6]);
	
	ИмяСтраницы = "";
	
	Для каждого Страница Из Элементы.СтраницыСписковЭлементовОбъектовМетаданныхКонфгурации.ПодчиненныеЭлементы Цикл
		Для каждого ПодчиненныйЭлемент Из Страница.ПодчиненныеЭлементы Цикл
			Если ПодчиненныйЭлемент.Имя = ИмяСписка Тогда
				ИмяСтраницы = Страница.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	ИмяКомандыЗакрытия = ИмяЭлементаКомандыЗакрытия;
	
	// Сформировать списки реквизитов и элементов на удаление.
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(ИмяКомандыЗакрытия);
	МассивЭлементов.Добавить(ИмяСписка);
	МассивЭлементов.Добавить(ИмяСтраницы);
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(ИмяСписка);
	
	// ... удаляем элементы в начале.
	
	Для каждого ИмяЭлемента Из МассивЭлементов Цикл
		Элементы.Удалить(Элементы[ИмяЭлемента]);
	КонецЦикла;
	
	// ... потом реквизиты.
	
	ЭтаФорма.ИзменитьРеквизиты(, МассивРеквизитов);
	
	ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды[ИмяКомандыЗакрытия]);
	
КонецПроцедуры

&НаСервере
Процедура СписокЭлементовОМНастроитьКолонки(ИмяЭлементаКомандыНастройки)
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяЭлементаКомандыНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	ЭтаОбработка = ЭтаОбработка();
	
	ЧастиСтроки = ЭтаОбработка.РазложитьСтрокуВМассивПодстрок(ИмяЭлементаКомандыНастройки, Объект.РазделительЧастейИмен);
	
	ИмяКоллекции = ЧастиСтроки[3];
	ИмяОбъектаМетаданных = ЧастиСтроки[5];
	
	// Установить заголовок.
	
	Элементы.НастройкиКолонокСпискаИмя.Заголовок = ЧастиСтроки[4] + "." + ЧастиСтроки[5];
	
	// Определить имя элемента списка.
	
	ЧастиСтрокиИмениЭлементаСписка = Новый Массив;
	ЧастиСтрокиИмениЭлементаСписка.Добавить(ЧастиСтроки[2]);
	ЧастиСтрокиИмениЭлементаСписка.Добавить(ЧастиСтроки[3]);
	ЧастиСтрокиИмениЭлементаСписка.Добавить(ЧастиСтроки[4]);
	ЧастиСтрокиИмениЭлементаСписка.Добавить(ЧастиСтроки[5]);
	ЧастиСтрокиИмениЭлементаСписка.Добавить(ЧастиСтроки[6]);
	
	ИмяЭлементаСписка = ЭтаОбработка.СтрокаИзМассиваПодстрок(ЧастиСтрокиИмениЭлементаСписка, Объект.РазделительЧастейИмен);
	
	// Получить таблицу элементов списка.
	
	тз_ТаблицаКолонокЭлементаСписка = Новый ТаблицаЗначений;
	тз_ТаблицаКолонокЭлементаСписка.Колонки.Добавить("ИмяКолонки");
	тз_ТаблицаКолонокЭлементаСписка.Колонки.Добавить("ИмяРеквизита");
	тз_ТаблицаКолонокЭлементаСписка.Колонки.Добавить("Видимость");
	
	Для каждого ЭлКолонка Из Элементы[ИмяЭлементаСписка].ПодчиненныеЭлементы Цикл
		
		СтрокаТз = тз_ТаблицаКолонокЭлементаСписка.Добавить();
		СтрокаТз.ИмяКолонки = ЭлКолонка.Имя;
		
		ЧастиСтрокиПутьКДанным = ЭтаОбработка.РазложитьСтрокуВМассивПодстрок(ЭлКолонка.ПутьКДанным, ".");
		СтрокаТз.ИмяРеквизита = ЧастиСтрокиПутьКДанным[1];
		СтрокаТз.Видимость = ЭлКолонка.Видимость;
		
	КонецЦикла;
	
	// Получить параметры колонок списка.
	
	ПараметрыКолонокСписка = ЭтаОбработка.ПараметрыКолонокСпискаЭлементовОМ(ИмяКоллекции, ИмяОбъектаМетаданных);
	
	дз_НастройкиКолонокСписка = РеквизитФормыВЗначение("НастройкиКолонокСписка");
	дз_НастройкиКолонокСписка.Строки.Очистить();
	
	Для каждого КлючЗначение Из ПараметрыКолонокСписка Цикл
		
		Если КлючЗначение.Значение.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		стр_ГруппаРеквизитов = дз_НастройкиКолонокСписка.Строки.Добавить();
		стр_ГруппаРеквизитов.НастройкиКолонокСпискаТипЗаписи = "ГруппаКолонок";
		стр_ГруппаРеквизитов.НастройкиКолонокСпискаИмя = КлючЗначение.Ключ;
		
		Если КлючЗначение.Ключ = "СтандартныеРеквизиты" Тогда
			стр_ГруппаРеквизитов.НастройкиКолонокСпискаНомерКартинки = 1;
		ИначеЕсли КлючЗначение.Ключ = "Реквизиты" Тогда
			стр_ГруппаРеквизитов.НастройкиКолонокСпискаНомерКартинки = 2;
		ИначеЕсли КлючЗначение.Ключ = "Измерения" Тогда
			стр_ГруппаРеквизитов.НастройкиКолонокСпискаНомерКартинки = 3;
		ИначеЕсли КлючЗначение.Ключ = "Ресурсы" Тогда
			стр_ГруппаРеквизитов.НастройкиКолонокСпискаНомерКартинки = 4;
		КонецЕсли;
		
		стр_ГруппаРеквизитов.НастройкиКолонокСпискаИмяЭлементаСписка = ИмяЭлементаСписка;
		
		Для каждого ПараметрыКолонки Из КлючЗначение.Значение Цикл
			
			стр_Реквизит = стр_ГруппаРеквизитов.Строки.Добавить();
			стр_Реквизит.НастройкиКолонокСпискаТипЗаписи         = "Колонка";
			стр_Реквизит.НастройкиКолонокСпискаИмя               = ПараметрыКолонки.ИмяРеквизита;
			стр_Реквизит.НастройкиКолонокСпискаНомерКартинки     = стр_ГруппаРеквизитов.НастройкиКолонокСпискаНомерКартинки;
			стр_Реквизит.НастройкиКолонокСпискаИмяЭлементаСписка = ИмяЭлементаСписка;
			стр_Реквизит.НастройкиКолонокСпискаПредставлениеТипа = ПараметрыКолонки.ПредставлениеТипа;
			
			СтрокаТаблицыКолонок = тз_ТаблицаКолонокЭлементаСписка.Найти(ПараметрыКолонки.ИмяРеквизита, "ИмяРеквизита");
			
			Если Не (СтрокаТаблицыКолонок = Неопределено) Тогда
				
				стр_Реквизит.НастройкиКолонокСпискаИмяКолонки = СтрокаТаблицыКолонок.ИмяКолонки;
				стр_Реквизит.НастройкиКолонокСпискаВидимость  = СтрокаТаблицыКолонок.Видимость;
				
			КонецЕсли;
			
		КонецЦикла;
		
		стр_ГруппаРеквизитов.Строки.Сортировать("НастройкиКолонокСпискаИмя");
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(дз_НастройкиКолонокСписка, "НастройкиКолонокСписка");
	
	Элементы.ГруппаНастройкаКолонокСписка.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Функции

#Область НаКлиенте

&НаКлиенте
Функция СтруктураСтрокиМетаданныхКонфигурации(ДанныеСтроки)
	
	ЗаписьСтруктурыМетаданныхКонфигурации = Тип_ЗаписьСтруктурыМетаданныхКонфигурации();
	
	ЗаполнитьЗначенияСвойств(ЗаписьСтруктурыМетаданныхКонфигурации, ДанныеСтроки);
	
	Результат = ЗаписьСтруктурыМетаданныхКонфигурации;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НаСервере

&НаСервере
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки)
	
	Результат = ЭтаОбработка().ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки);
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ИмяОсновнойФормыОбъектаОбработкиДанных(СвойстваОбъекта)
	
	Результат = ЭтаОбработка().ИмяОсновнойФормыОбъектаОбработкиДанных(СвойстваОбъекта);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭлементКоллекцииЯвляетсяСредствомОбработкиДанных(СтруктураМетаданныхКонфигурацииИмяКоллекции)
	
	Результат = ЭтаОбработка().ЭлементКоллекцииЯвляетсяСредствомОбработкиДанных(СтруктураМетаданныхКонфигурацииИмяКоллекции);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтображениеСпискаЭлементовКоллекцииДоступно(СтруктураМетаданныхКонфигурацииИмяКоллекции)
	
	Результат = ЭтаОбработка().ОтображениеСпискаЭлементовКоллекцииДоступно(СтруктураМетаданныхКонфигурацииИмяКоллекции);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКДаннымКолонкиСпискаЭлементовОМ(ИмяСписка, ИмяКолонки)
	
	Результат = "";
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку("%1.%2", ИмяСписка, ИмяКолонки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяКолонкиСпискаЭлементовОМ(ИмяКолонки, СтрокаСтруктурыМетаданныхКонфигурации)
	
	Результат = "";
	
	УвеличитьСчетчикДобавленныхЭлементов();
	
	НомерЭлемента = СчетчикДобавленныхЭлементов;
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку(
		"Колонка" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "%2" + Объект.РазделительЧастейИмен + "%3" + Объект.РазделительЧастейИмен + "%4" + Объект.РазделительЧастейИмен + "%5", 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяКоллекции, 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции,
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмя,
		ИмяКолонки,
		НомерЭлемента
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыКолонокСпискаЭлементовОМ(СтрокаСтруктурыМд)
	
	Результат = Новый Массив;
	ПустойРезультат = Новый Массив;
	
	#Область Предусловия
	
	Если СтрокаСтруктурыМд = Неопределено Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	Результат = ЭтаОбработка().ПараметрыКолонокСпискаЭлементовОМ(
		СтрокаСтруктурыМд.СтруктураМетаданныхКонфигурацииИмяКоллекции, 
		СтрокаСтруктурыМд.СтруктураМетаданныхКонфигурацииИмя
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяОсновнойТаблицыСпискаЭлементовОбъектаМетаданных(СтрокаСтруктурыМетаданныхКонфигурации)
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку("%1.%2", 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции, 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмя
	);
	
	Возврат Результат;
	
КонецФункции

// Имя списка элементов.
//
// Параметры:
//	СтрокаСтруктурыМетаданныхКонфигурации - Строка - данные выбранной строки дерева метаданных.
//
// Возвращаемое значение:
//	Тип: Строка
//	Имя списка элементов, например: "Список_Справочники_Справочник_Товары_1".
//	
&НаСервере
Функция ИмяСпискаЭлементовОбъектаМетаданных(СтрокаСтруктурыМетаданныхКонфигурации)
	
	Результат = "";
	
	// TODO: Требуется рефакторинг. Надо разнести по разным ФЕ собственно увеличение счетчика добавленных
	// элементов и составление имени элемента из всех "ингредиентов".
	
	УвеличитьСчетчикДобавленныхЭлементов();
	НомерЭлемента = СчетчикДобавленныхЭлементов;
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку(
		"Список" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "%2" + Объект.РазделительЧастейИмен + "%3" + Объект.РазделительЧастейИмен + "%4", 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяКоллекции, 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции,
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмя,
		НомерЭлемента
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаголовокСтраницыСпискаЭлементовОМ(СтрокаСтруктурыМетаданныхКонфигурации)
	
	Результат = "";
	ПустойРезультат = "";
	
	#Область Предусловия
	
	Если СтрокаСтруктурыМетаданныхКонфигурации = Неопределено Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку(
		"%1.%2", 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции, 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмя
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяСтраницыСпискаЭлементовОМ(СтрокаСтруктурыМетаданныхКонфигурации)
	
	Результат = "";
	ПустойРезультат = "";
	
	#Область Предусловия
	
	Если СтрокаСтруктурыМетаданныхКонфигурации = Неопределено Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	УвеличитьСчетчикДобавленныхЭлементов(); 
	
	НомерЭлемента = СчетчикДобавленныхЭлементов;
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку(
		"Страница" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "%2" + Объект.РазделительЧастейИмен + "%3" + Объект.РазделительЧастейИмен + "%4", 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяКоллекции, 
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмяЭлементаКоллекции,
		СтрокаСтруктурыМетаданныхКонфигурации.СтруктураМетаданныхКонфигурацииИмя,
		НомерЭлемента
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КоличествоЭлементовКоллекцииТипаОбъектаМетаданных(ИмяКоллекцииМетаданных, ИмяОбъектаМетаданных)
	
	Результат = ЭтаОбработка().КоличествоЭлементовКоллекцииТипаОбъектаМетаданных(ИмяКоллекцииМетаданных, ИмяОбъектаМетаданных);
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ИмяДопКомандыСпискаЭлементовОМ(ИмяСпискаЭлементов, ТипДопКоманды)
	
	Результат = "";
	ПустойРезультат = "";
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяСпискаЭлементов) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипДопКоманды) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку("Команда" + Объект.РазделительЧастейИмен + "%1" + Объект.РазделительЧастейИмен + "%2", ТипДопКоманды, ИмяСпискаЭлементов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКДаннымПоляСпискаЭлементов(ИмяПоляСписка)
	
	ЧастиСтроки = ЭтаОбработка().РазложитьСтрокуВМАссивПодстрок(ИмяПоляСписка, Объект.РазделительЧастейИмен);
	
	Результат = ЧастиСтроки[ЧастиСтроки.Количество() - 2];
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = ЭтаОбработка().ПодставитьПараметрыВСтроку(СтрокаПодстановки, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НаСервереБезКонтекста

&НаСервереБезКонтекста
Функция СтруктураОбъектаМетаданных(ИмяКоллекции, ИмяОбъектаМетаданных)
	
	Результат = Новый Структура;
	ПустойРезультат = Неопределено;
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяКоллекции) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяОбъектаМетаданных) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	Попытка
		ОбъектМд = Метаданные[ИмяКоллекции][ИмяОбъектаМетаданных];
	Исключение
		Возврат ПустойРезультат;
	КонецПопытки;
	
	КоллекцииСвойств = КоллекцииСвойствОбъектаМетаданных();
	
	Для каждого КоллекцияСвойств Из КоллекцииСвойств Цикл
		
		Попытка
			КоллекцияСвойствМд = ОбъектМд[КоллекцияСвойств.Имя];
		Исключение
			Продолжить;
		КонецПопытки;
		
		ДанныеКоллекции = Новый Массив;
		
		Если ТипЗнч(КоллекцияСвойствМд) = Тип("ОписанияСтандартныхРеквизитов") 
			Или ТипЗнч(КоллекцияСвойствМд) = Тип("КоллекцияЗначенийСвойстваОбъектаМетаданных") 
			Или ТипЗнч(КоллекцияСвойствМд) = Тип("КоллекцияОбъектовМетаданных") Тогда
			
			Для каждого ЭлементКоллекции Из КоллекцияСвойствМд Цикл
				
				ДанныеЭлементаКоллекции = Новый Структура("ТипЗаписи, Имя, Синоним, Комментарий, ДанныеКоллекции");
				ЗаполнитьЗначенияСвойств(ДанныеЭлементаКоллекции, ЭлементКоллекции);
				
				ДанныеЭлементаКоллекции.ДанныеКоллекции = Новый Массив;
				ДанныеЭлементаКоллекции.ТипЗаписи = "ОбъектМетаданных";
				
				Если КоллекцияСвойств.Имя = "ТабличныеЧасти" Тогда
					
					Для каждого Реквизит Из ЭлементКоллекции.Реквизиты Цикл
						
						СтруктураРеквизита = Новый Структура("ТипЗаписи, Имя, Синоним, Комментарий");
						ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Реквизит);
						
						СтруктураРеквизита.ТипЗаписи = "ОбъектМетаданных";
						
						ДанныеЭлементаКоллекции.ДанныеКоллекции.Добавить(СтруктураРеквизита);
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДанныеКоллекции.Добавить(ДанныеЭлементаКоллекции);
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(КоллекцияСвойствМд) = Тип("ОписаниеТипов") Тогда
			
			// Сделать:
			// Это ветка для построения списка источников. Надо разделять их по типам: справочники, документы и т.п.
			
			КоллекцияСвойствМд = КоллекцияСвойствМд.Типы();
			
			Для А = 0 По КоллекцияСвойствМд.Количество() - 1 Цикл
				
				ЭлементКоллекции = КоллекцияСвойствМд[А];
				ДанныеЭлементаКоллекции = Новый Структура("ТипЗаписи, Имя, Синоним, Комментарий, ДанныеКоллекции");
				
				ОбъектТипа = Новый(ЭлементКоллекции);
				МетаданныеОбъектТипа = ОбъектТипа.Метаданные();
				ЗаполнитьЗначенияСвойств(ДанныеЭлементаКоллекции, МетаданныеОбъектТипа);
				
				ДанныеЭлементаКоллекции.ДанныеКоллекции = Новый Массив;
				ДанныеЭлементаКоллекции.ТипЗаписи = "ОбъектМетаданных";
				
				Если КоллекцияСвойств.Имя = "ТабличныеЧасти" Тогда
					
					Для каждого Реквизит Из МетаданныеОбъектТипа.Реквизиты Цикл
						
						СтруктураРеквизита = Новый Структура("ТипЗаписи, Имя, Синоним, Комментарий");
						ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Реквизит);
						
						СтруктураРеквизита.ТипЗаписи = "ОбъектМетаданных";
						
						ДанныеЭлементаКоллекции.ДанныеКоллекции.Добавить(СтруктураРеквизита);
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДанныеКоллекции.Добавить(ДанныеЭлементаКоллекции);
				
				А = А + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Результат.Вставить(КоллекцияСвойств.Имя, Новый Структура("Коллекция, ДанныеКоллекции", КоллекцияСвойств, ДанныеКоллекции));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция КоллекцииСвойствОбъектаМетаданных()
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "СтандартныеРеквизиты", "СтандартныйРеквизит", "СтандартныеРеквизиты", "Стандартные реквизиты", 44));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Графы", "Граф", "Графы", "Графы"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "ЗначенияПеречисления", "ЗначениеПеречисления", "ЗначенияПеречисления", "Значения", 45));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Измерения", "Измерение", "Измерения", "Измерения", 47));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Ресурсы", "Ресурс", "Ресурсы", "Ресурсы", 48));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Реквизиты", "Реквизит", "Реквизиты", "Реквизиты", 45));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "ПризнакиУчета", "ПризнакУчета", "ПризнакиУчета", "Признаки учета"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "ПризнакиУчетаСубконто", "ПризнакУчетаСубконто", "ПризнакиУчетаСубконто", "Признаки учета субконто"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Перерасчеты", "Перерасчет", "Перерасчеты", "Перерасчеты"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "ТабличныеЧасти", "ТабличнаяЧасть", "ТабличныеЧасти", "Табличные части", 46));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Формы", "Форма", "Формы", "Формы", 33));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Команды", "Команда", "Команды", "Команды", 34));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Макеты", "Макет", "Макеты", "Макеты", 36));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Операции", "Операция", "Операции", "Операции"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Источник", "Источник", "Источник", "Источник"));
	
	Результат.Добавить(Новый Структура("ТипЗаписи, ИмяКоллекции, ИмяЭлементаКоллекции, Имя, Синоним, НомерКартинки", 
		"ГруппаОбъектовМетаданных", "Состав", "Состав", "Состав", "Состав"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Подключаемые

&НаКлиенте
Процедура Подключаемый_СписокЭлементовОбъектаМетаданных_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПутьКДаннымПоля = ПутьКДаннымПоляСпискаЭлементов(Поле.Имя);
	
	Попытка
		ПараметрыФормы = Новый Структура("ОбъектКонфигурации", Элемент.ТекущиеДанные[ПутьКДаннымПоля]);
	Исключение
		Возврат;
	КонецПопытки;
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаРедакторОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Типы

&НаСервере
Функция Тип_ЗаписьСтруктурыМетаданныхКонфигурации()
	
	Результат = ЭтаОбработка().Тип_ЗаписьСтруктурыМетаданныхКонфигурации();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Тип_СвойстваОбъектаОбработкиДанных()
	
	Результат = ЭтаОбработка().Тип_СвойстваОбъектаОбработкиДанных();
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция Тип_ПараметрыФормированияИмениЭлементаСписка()
	
	Результат = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти