
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ЦеныЗакупки.Записывать = Истина;
	
	Для Каждого	стр_Товары Из Товары Цикл
		
		зп_ТоварыНаСкладах = Движения.ТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(зп_ТоварыНаСкладах, стр_Товары);
		зп_ТоварыНаСкладах.Склад = Склад;
		зп_ТоварыНаСкладах.Период = Дата;
		
		зп_ЦеныЗакупки = Движения.ЦеныЗакупки.Добавить();
		ЗаполнитьЗначенияСвойств(зп_ЦеныЗакупки, стр_Товары);
		зп_ЦеныЗакупки.Товар = стр_Товары.Номенклатура;
		зп_ЦеныЗакупки.Контрагент = Контрагент;
		зп_ЦеныЗакупки.Период = Дата;
		
	КонецЦикла
	
КонецПроцедуры
