
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныЗакупки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Товар,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Цена КАК ЧИСЛО(15, 2)) КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Период КАК Период,
	|	ВТ_ТаблицаТоваров.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаТоваров.Товар КАК Товар,
	|	МАКСИМУМ(ВТ_ТаблицаТоваров.Цена) КАК Цена
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТоваров.Контрагент,
	|	ВТ_ТаблицаТоваров.Товар,
	|	ВТ_ТаблицаТоваров.Период";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ЭтотОбъект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);	
	
	Движения.ЦеныЗакупки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
