#Область Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаОбработка = ЭтаОбработка();
	
	ОбъектБазы = Параметры.ОбъектБазы;
	ПараметрыЗаписи = Параметры.ПараметрыЗаписи;
	
	Если ПараметрыЗаписи.ТипТаблицы = "ТабличнаяЧасть" Тогда
		
		ДанныеЗаписиОбъекта = ОбъектБазы[ПараметрыЗаписи.ИмяТаблицы][ПараметрыЗаписи.НомерЗаписи - 1];
		
		МетаданныеОбъекта = ОбъектБазы.Метаданные();
		
		дз_ДанныеЗаписи = РеквизитФормыВЗначение("ДанныеЗаписи");
		дз_ДанныеЗаписи.Строки.Очистить();
		
		стр_ДанныеЗаписи = дз_ДанныеЗаписи.Строки.Добавить();
		стр_ДанныеЗаписи.ИмяРеквизита = "НомерСтроки";
		стр_ДанныеЗаписи.ЗначениеРеквизита = ПараметрыЗаписи.НомерЗаписи;
		стр_ДанныеЗаписи.СинонимРеквизита = "№";
		стр_ДанныеЗаписи.ТипРеквизита = "Число";
		стр_ДанныеЗаписи.ПредставлениеТипа = "Число";
		стр_ДанныеЗаписи.ИндексКартинки = 44;
		
		Для каждого РеквизитТЧ Из МетаданныеОбъекта.ТабличныеЧасти[ПараметрыЗаписи.ИмяТаблицы].Реквизиты Цикл
			
			стр_ДанныеЗаписи = дз_ДанныеЗаписи.Строки.Добавить();
			стр_ДанныеЗаписи.ИмяРеквизита = РеквизитТЧ.Имя;
			стр_ДанныеЗаписи.ЗначениеРеквизита = ДанныеЗаписиОбъекта[РеквизитТЧ.Имя];
			стр_ДанныеЗаписи.ТипРеквизита = РеквизитТЧ.Тип;
			стр_ДанныеЗаписи.СинонимРеквизита = РеквизитТЧ.Синоним;
			стр_ДанныеЗаписи.КомментарийРеквизита = РеквизитТЧ.Комментарий;
			стр_ДанныеЗаписи.ПредставлениеТипа = ЭтаОбработка.СтрокаОписанияТипов(РеквизитТЧ.Тип);
			стр_ДанныеЗаписи.ИндексКартинки = 45;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(дз_ДанныеЗаписи, "ДанныеЗаписи");
		
		Заголовок = "(...) " + Строка(ОбъектБазы) + " [" + ПараметрыЗаписи.ТипТаблицы + "] [" + ПараметрыЗаписи.ИмяТаблицы + "] [" + ПараметрыЗаписи.НомерЗаписи + "]";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "Навигатор" Тогда
		
		Если ИмяСобытия = "ЗакрытьВсеОкнаРедакторов" Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДанныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура("ОбъектБазы", Элементы.ДанныеЗаписи.ТекущиеДанные["ЗначениеРеквизита"]);
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаРедакторОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыОткрытия, ЭтаФорма, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки)
	
	Результат = ЭтаОбработка().ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции
