
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого ОбъектМд Из Метаданные.Константы Цикл
		
		СтрокаТбл = ЗначенияКонстант.Добавить();
		СтрокаТбл.ЗначенияКонстантИмя = ОбъектМд.Имя;
		СтрокаТбл.ЗначенияКонстантСиноним = ОбъектМд.Синоним;
		СтрокаТбл.ЗначенияКонстантКомментарий = ОбъектМд.Комментарий;
		СтрокаТбл.ЗначенияКонстантТипЗначения = ОбъектМд.Тип;
		СтрокаТбл.ЗначенияКонстантЗначение = Константы[ОбъектМд.Имя].Получить();
		СтрокаТбл.ЗначенияКонстантТипЗначенияПредставление = ОбъектМд.Тип;
		СтрокаТбл.ЗначенияКонстантУдалить = Врег(Лев(ОбъектМд.Имя, СтрДлина("Удалить"))) = Врег("Удалить");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		ПараметрыФормы = Новый Структура("ОбъектКонфигурации", Элемент.ТекущиеДанные[Поле.Имя]);
	Исключение
		Возврат;
	КонецПопытки;
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "ФормаРедакторОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки)
	
	Результат = ЭтаОбработка().мПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки);
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции
