
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тз_СвойстваОбъектаМетаданных = РеквизитФормыВЗначение("СвойстваОбъектаМетаданных");
	тз_СвойстваОбъектаМетаданных.Очистить();
	
	Если ТипЗнч(Параметры.ОбъектКонфигурации) = Тип("Структура") Тогда
		
		Если Параметры.ОбъектКонфигурации.ТипОбъекта = "ПользовательИнформационнойБазы" Тогда
			
			ПользовательБазы = ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.ОбъектКонфигурации.ИмяПользователя);
			
			Если Не (ПользовательБазы = Неопределено) Тогда
				
				МетаданныеПользователя = ЭтаОбработка().МетаданныеПользователяИнформационнойБазы();
				
				Для каждого СвойствоПользователя Из МетаданныеПользователя Цикл
					
					стр_СвойстваОбъектаМетаданных = тз_СвойстваОбъектаМетаданных.Добавить();
					стр_СвойстваОбъектаМетаданных.СвойстваОбъектаМетаданныхИмя = СвойствоПользователя.Имя;
					стр_СвойстваОбъектаМетаданных.СвойстваОбъектаМетаданныхСиноним = СвойствоПользователя.Синоним;
					стр_СвойстваОбъектаМетаданных.СвойстваОбъектаМетаданныхПредставление = ПользовательБазы[СвойствоПользователя.Имя];
					стр_СвойстваОбъектаМетаданных.СвойстваОбъектаМетаданныхЗначение = ПользовательБазы[СвойствоПользователя.Имя];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(тз_СвойстваОбъектаМетаданных, "СвойстваОбъектаМетаданных");
	
КонецПроцедуры

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции
