
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тз_ВсеПользователи = РеквизитФормыВЗначение("ВсеПользователи");
	
	ПользователиБазы = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для каждого ПользовательБазы Из ПользователиБазы Цикл
		стр_ВсеПользователи = тз_ВсеПользователи.Добавить();
		ЗаполнитьЗначенияСвойств(стр_ВсеПользователи, ПользовательБазы);
	КонецЦикла;
	
	тз_ВсеПользователи.Сортировать("Имя");
	ЗначениеВРеквизитФормы(тз_ВсеПользователи, "ВсеПользователи");
	
	// АутентификацияOpenID
	// АутентификацияОС
	// АутентификацияСтандартная
	// ЗапрещеноИзменятьПароль
	// ЗащитаОтОпасныхДействий
	// Имя
	// ОсновнойИнтерфейс
	// Пароль
	// ПарольУстановлен
	// ПоказыватьВСпискеВыбора
	// ПолноеИмя
	// ПользовательОС
	// РазделениеДанных
	// РежимЗапуска
	// Роли
	// СохраняемоеЗначениеПароля
	// УникальныйИдентификатор
	// Язык
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "Навигатор" Тогда
		
		Если ИмяСобытия = "ЗакрытьВсеОкнаРедакторов" Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки)
	
	Результат = ЭтаОбработка().мПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки);
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции

